allure-results/8903775356b043aebc02f8c1f6be6459-attachmentxml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GetReceipientPromotionRules xmlns="http://tempuri.org/"><SourceCountryISOCode>USA</SourceCountryISOCode><DestinationCountryISOCode>MEX</DestinationCountryISOCode><AgentCode>PRODTEST717</AgentCode></GetReceipientPromotionRules></soap:Body></soap:Envelope>